Documents/ПринятиеВРаботуОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПринятиеВРаботуОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашенаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбещаниеОплатить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКатегории</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УслугиПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УслугиПоДоговору</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПринятиеВРаботуОрганизации/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъектыВРаботе, ТаблицаДвиженийСобытия) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Дата",	ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Автор",	ЭтотОбъект.Автор);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР ТИПЗНАЧЕНИЯ(ПринятиеВРаботуОрганизацииОбъекты.Объект)
	               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
	               |			ТОГДА ВЫРАЗИТЬ(ПринятиеВРаботуОрганизацииОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
	               |		ИНАЧЕ ПринятиеВРаботуОрганизацииОбъекты.Объект
	               |	КОНЕЦ КАК Объект,
	               |	ПринятиеВРаботуОрганизацииОбъекты.Ссылка КАК Регистратор,
	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	Документ.ПринятиеВРаботуОрганизации.Объекты КАК ПринятиеВРаботуОрганизацииОбъекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	               |		ПО (ПринятиеВРаботуОрганизацииОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
	               |				ИЛИ ВЫРАЗИТЬ(ПринятиеВРаботуОрганизацииОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
	               |ГДЕ
	               |	ПринятиеВРаботуОрганизацииОбъекты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР ТИПЗНАЧЕНИЯ(ПринятиеВРаботуОрганизацииОбъекты.Объект)
	               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
	               |			ТОГДА ВЫРАЗИТЬ(ПринятиеВРаботуОрганизацииОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
	               |		ИНАЧЕ ПринятиеВРаботуОрганизацииОбъекты.Объект
	               |	КОНЕЦ,
	               |	ПринятиеВРаботуОрганизацииОбъекты.Ссылка,
	               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	               |	Таблица.Объект КАК Объект,
	               |	1 КАК Количество,
	               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
	               |	&Организация КАК Организация,
	               |	NULL КАК Сотрудник
	               |ИЗ
	               |	Таблица КАК Таблица
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОстатокВРаботе УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Дата КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуОрганизации) КАК ВидСобытия,
	               |	Таблица.Регистратор КАК ИсточникСобытия,
	               |	Таблица.Объект КАК Объект,
	               |	NULL КАК Подразделение,
	               |	NULL КАК Сотрудник,
	               |	&Автор КАК Автор
	               |ИЗ
	               |	Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Таблица";
				   				   
	Результат = Запрос.ВыполнитьПакет();              
	ТаблицаДвиженийОбъектыВРаботе = Результат[1].Выгрузить();
	ТаблицаДвиженийСобытия = Результат[2].Выгрузить();
КонецПроцедуры
